tutorials/TimeDepLid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       79600;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       79800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
